#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

null_resource.example: Refreshing state... [id=3800686401145135321]
azurerm_resource_group.DemoRG: Refreshing state... [id=/subscriptions/93b69dba-95f6-4199-ac0a-86814d6fc894/resourceGroups/PowerShellChicago_FullStackGeek]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_public_ip.public_ip will be created
  + resource "azurerm_public_ip" "public_ip" {
      + allocation_method       = "Dynamic"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "southcentralus"
      + name                    = "fsg-public-ip-PowerShellChicagoDemo"
      + resource_group_name     = "PowerShellChicago_FullStackGeek"
      + sku                     = "Basic"
    }

  # azurerm_subnet.subnet will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "10.0.10.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "fsg-subnet-PowerShellChicagoDemo"
      + resource_group_name                            = "PowerShellChicago_FullStackGeek"
      + virtual_network_name                           = "fsg-vnet-PowerShellChicagoDemo"
    }

  # azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "southcentralus"
      + name                = "fsg-vnet-PowerShellChicagoDemo"
      + resource_group_name = "PowerShellChicago_FullStackGeek"
      + subnet              = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @jhoughes, Action: `pull_request`, Working Directory: ``, Workflow: `Automated Terraform`*